#include <iostream>
#include <math.h>
using namespace std;
//Пишем калькулятор. На вход программе подается следующее
// 2 ЦЕЛЫХ числа и СИМВОЛ арифметической операции разделенные пробелами
//Все возможные символы арифметических операций - (+, -, X, /, >, <, ^).

//ПРИМЕР:
//1 2 +                                       3
//2 4 >                                       False
//2 3 ^                                       8
//2 5 X                                       10
int main()
{
    int c = 0;
    //while ( i < 10 ){
    //    cout << i <<endl;
     //   i +=  100; // i = i + 100
    //}
    do{
        cout<<c<<endl;
        c++; // 
    }while(c < 10);
    return 0;
}